const deviceStatus = (key) => {
    let obj = {
        0: "未知",
        1: "正常",
        2: "离线",
        3: "报警",
        4: "报警解除",
        5: "恢复在线",
        6: "激活",
        7: "关机",
        8: "低电量",
        9: "故障",
        10: "设备故障+低电",
        11: "设备被拆除/分离",
        12: "设备已安装/合并",
        16: "温度高",
        17: "设备开始自检",
        18: "设备结束自检",
        19: "主传感器发生报警",
        20: "主传感器出现故障",
        21: "次传感器出现报警",
        22: "次传感器出现故障",
        23: "MCU的外部低速晶振错误",
        24: "MCU的外部高速晶振错误",
        25: "系统故障",
        26: "传感器故障",
        27: "传感器报警",
        61: "射频开启",
        62: "射频关闭",
        28: "门打开",
        29: "门关闭",
        30: "重新启动",
        31: "启动",
        32: "火警",
        33: "反馈",
        34: "监管",
        35: "屏蔽",
        36: "回路信息",
        37: "节点信息",
        38: "消音",
        39: "设置时间",
        40: "预留",
        41: "监管报警",
        42: "启动并反馈",
        43: "模块启动",
        44: "开路",
        45: "短路",
        46: "回路板通讯故障",
        47: "多线回路板通讯故障",
        48: "气体控制板通讯故障",
        49: "CAN总线通讯故障",
        50: "接线断路",
        51: "接线短路",
        52: "通讯故障",
        53: "回路报警",
        54: "电源过压",
        55: "电源欠压",
        56: "电源过流",
        57: "电源缺相",
        58: "电源断电",
        59: "超温度",
        60: "电弧故障",
        63: "液位过高",
        64: "高压报警",
        65: "高压预警",
        66: "低压预警",
        67: "低压报警",
        68: "高液位报警",
        69: "高液位预警",
        70: "低液位预警",
        71: "低液位报警",
        100: "外控电源故障",
        101: "应急广播故障",
        102: "设备电池电量低",
        103: "面板信号",
        104: "现场信号",
        105: "火警信号",
        106: "面板喷洒",
        107: "现场喷洒",
        108: "火警喷洒",
        109: "面板启动",
        110: "现场启动",
        111: "火警启动",
        112: "不明启动",
    }
    return obj[key];
}
const codeName = (key) => {
    let obj = {
        1: '待处理',
        2: '维修',
        3: '现场处理',
        4: '不做处理',
        5: '屏蔽通知'
    }
    return obj[key];
}
const DeviceType = (key) => {
    let obj = {
        0: "未知",
        1: "点型感烟火灾探测器",
        3: "警铃",
        4: "手动火灾报警器",
        5: "火灾声光报警器",
        6: "可燃气体探测器",
        7: "门磁开关探测器",
        8: "独立式感温火灾探测报警器",
        9: "变送器",
        10: "超声波距离检测器",
        11: "语音提示器",
        12: "一氧化碳探测器",
        13: "控烟探测器",
        14: "火灾报警控制器",
        15: "转换开关探测器",
        16: "液位计",
        17: "压力计",
        18: "SOS报警器",
        19: "GPS跟踪器",
        20: "SOS+GPS报警器",
        21: "多功能DTU",
        22: "4G+以太网型DTU",
        23: "以太网型DTU",
        24: "4G型DTU",
        25: "NB型DTU",
        26: "LoRa+NB型透传模块",
        27: "LoRaWan型透传模块",
        28: "LoRaLite型模块",
        29: "NB型模块",
        30: "电气火灾传感器",
        31: "DTU/网关设备",
    }
    return obj[key];
}
const LevCodeName = (key) => {
    let obj = {
        1: '一般',
        2: '重要',
        3: '紧急'
    }
    return obj[key];
}

const pushEvent = () => {
    let obj = {
        1: '设备报警信息',
        2: '系统通知信息'
    }
    return obj[key];
}
export {
    DeviceType, // 设备类型
    deviceStatus, //设备状态
    codeName, //事件处理名称
    LevCodeName, // 事件等级
    pushEvent//推送消息
}